---
kind: other
id: Properties.T:Autodesk.Revit.DB.ImagePlacementOptions
source: html/5c35f408-1e72-11b1-087d-180bebd82e0d.htm
---
# ImagePlacementOptions Properties

Specifies whether the .NET object represents a valid Revit entity.